package coll;

public class Stack01 {
//컬랙션 큐 스택
	/* 자료구조
	 * 스택 : 차곡차곡 쌓아 올린 형태의 자료구조 : 후입 선출
	 * 
	 * 특징 :
	 * 	웹 브라우저 방문기록 (뒤로 가기)
	 * 	가장 나중에 열린 페이지부터 다시 보여준다
	 * 	역순 문자열 만들기
	 * 	실행 취소
	 * 	후위 표기법 계산
	 * 
	 * 
	 * 큐 : 줄, 혹은 줄을 서서 기다리는 것 : 순차 처리-선입 선출
	 * 
	 * 특징
	 * 	큐의 가장 첫 원소를 front / 기장 끝 원소를 rear
	 * 	큐는 들어올 때 rear로 들어오지만
	 * 	나올 때는 front 부터 빠지는 특성
	 *	접근 방법은 가장 첫 원소와 끝 원소로만 가능
	 *	가장 먼저 들어온 프론트 원소가 가장 먼저 삭제
	 *	
	 *	우선 순위가 같은 작업 예약 (프린터의 대기 인쇄열)
	 *	프로세스 관리
	 *	너비 우선 탐색(BFS, breadth-first search)구현
	 *	캐시(cache) 구현
	 */
}
